app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    @song = Song.new
    if params[:artist_id] && Artist.find_by(id: params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @song = Song.find_by(id: params[:id])
    @artist = Artist.find_by(id: params[:artist_id])